export const JXColor = {

/**黑色*/
C000000: cc.color(0, 0, 0,255),
/**规范白色*/
Cffffff: cc.color(255, 255, 255,255),
/**规范灰色*/
C949494: cc.color(148, 148, 148,255),
/**按钮字灰色*/
C636363: cc.color(99, 99, 99,255),
/**回合战斗名字颜色1-敌方阵容*/
CFFF075: cc.color(255, 240, 117,255),
/**回合战斗名字颜色2-自己*/
C8BF5FF: cc.color(139, 245, 255,255),
/**回合战斗名字颜色1描边-敌方阵容*/
C925600: cc.color(146, 86, 0,255),
/**回合战斗名字颜色2描边-自己*/
C133D5B: cc.color(19, 61, 91,255),
/**回合战斗名字颜色3-己方仙灵*/
CA4FF9F: cc.color(164, 255, 159,255),
/**回合战斗名字颜色3描边-己方仙灵*/
C004A00: cc.color(0, 74, 0,255),
/**被动技能*/
C2AFFFC: cc.color(42, 255, 252,255),
/**主动技能显示颜色*/
CFFD74E: cc.color(255, 215, 78,255),
/**部分属性颜色*/
CFFFD42: cc.color(255, 253, 66,255),
/**人物颜色*/
C382F0D: cc.color(56, 47, 13,255),
/**纯红色*/
Cff0000: cc.color(255, 0, 0,255),
/**公告左边选中文字 */
C472811: cc.color(71, 40, 17,255),
/**道具不足數量顔色*/
CFF003D: cc.color(255,0,61,255),
/**道具足夠道具數量*/
C00FF3D: cc.color(0,255,61,255),
/**道具足夠道具數量*/
C66FF00: cc.color(102,255,0,255),
}